package com.betel.estatemgmt.business.web.material.constant;

/**
 * Created by zhangjian on 2017/6/21.
 */
public interface BuildMaterialValidation {
    /**
     * 关键字字符长度和格式校验规则
     */
    String KEY_WORD_RULE = "[^\\\\<>%'\"]{0,60}";

    /**
     * 材料名称是否合法校验规则
     */
    String MATERIAL_NAME_RULE = "[^\\\\<>%'\"]{1,20}";
    /**
     * 类型名称是否合法校验规则
     */
    String MATERIAL_TYPE_NAME_RULE = "[^\\\\<>%'\"]{1,20}";

    /**
     * 建材型号是否合法校验规则
     */
    Integer MATERIAL_MODEL_RULE = 20;
    /**
     * 建材品牌是否合法校验规则
     */
    Integer MATERIAL_BRAND_RULE = 20;
    /**
     * 建材规格是否合法校验规则
     */
    Integer MATERIAL_SPECIFICATION_RULE = 20;
    /**
     * 建材产地是否合法校验规则
     */
    Integer MATERIAL_ORIGIN_RULE = 50;
    /**
     * 建材生产日期是否合法校验规则yyyy-MM-dd
     */
    String MATERIAL_PRODUCE_DATE_RULE = "^((\\d{2}(([02468][048])|([13579][26]))[\\-\\s]?((((0?[13578])|(1[02]))[\\-\\s]?((0?[1-9])|([1-2][0-9])|(3[01])))|(((0?[469])|(11))[\\-\\s]?((0?[1-9])|([1-2][0-9])|(30)))|(0?2[\\-\\s]?((0?[1-9])|([1-2][0-9])))))|(\\d{2}(([02468][1235679])|([13579][01345789]))[\\-\\s]?((((0?[13578])|(1[02]))[\\-\\s]?((0?[1-9])|([1-2][0-9])|(3[01])))|(((0?[469])|(11))[\\-\\s]?((0?[1-9])|([1-2][0-9])|(30)))|(0?2[\\-\\s]?((0?[1-9])|(1[0-9])|(2[0-8]))))))";
    /**
     * 建材截止日期是否合法校验规则
     */
    String MATERIAL_WARRANTY_DATE_RULE_RULE = "^((\\d{2}(([02468][048])|([13579][26]))[\\-\\s]?((((0?[13578])|(1[02]))[\\-\\s]?((0?[1-9])|([1-2][0-9])|(3[01])))|(((0?[469])|(11))[\\-\\s]?((0?[1-9])|([1-2][0-9])|(30)))|(0?2[\\-\\s]?((0?[1-9])|([1-2][0-9])))))|(\\d{2}(([02468][1235679])|([13579][01345789]))[\\-\\s]?((((0?[13578])|(1[02]))[\\-\\s]?((0?[1-9])|([1-2][0-9])|(3[01])))|(((0?[469])|(11))[\\-\\s]?((0?[1-9])|([1-2][0-9])|(30)))|(0?2[\\-\\s]?((0?[1-9])|(1[0-9])|(2[0-8]))))))";
    /**
     * 建材自定义参数名称是否合法校验规则
     */
    String MATERIAL_CUSTOM_PARAM_NAME_RULE = "[^\\\\<>%'\"]{1,20}";
    /**
     * 建材自定义参数内容是否合法校验规则
     */
    Integer MATERIAL_CUSTOM_PARAM_CONTENT_RULE = 512;
    /**
     * 建材图片大小20M
     */
    Long MATERIAL_PIC_LENGTH_MAX_RULE = 20 * 1024 * 1024L;
    /**
     * ZIP文件的大小
     */
    Long MATERIAL_ZIP_LENGTH_MAX_RULE = 40 * 1024 * 1024L;


}
