/**
 * Created by Administrator on 2017/5/17.
 */

var path = window.location.href.substring(0,window.location.href.indexOf('/index.html'));

var returnMsg = {
    "00000":"操作成功",
    "99999":"操作失败",
    "11111":"鉴权不通过",
    "22222":"账号不存在",
    "33333":"登录超时，请重新登录",
    "T1010":"ID未空",
    "T2020":"标题格式错误",
    "T3030":"昵称格式错误",
    "T4040":"开始时间格式错误",
    "T5050":"结束时间格式错误",
    "T6060":"开始时间不能大于结束时间错误",
    "T7070":"未定义状态码错误",
    "A":{
        "A0001":"管理员ID为空",
        "A0002":"广告标题为空",
        "A0003":"广告内容为空",
        "A0004":"读取文件失败",
        "A0005":"广告标题字符格式错误",
        "A0006":"输入的内容过长",
        "A0007":"图片类型必须是.png,jpeg,jpg,bmp中的一种！",
        "A0008":"广告图编号为空",
        "A0009":"广告编号数组为空",
        "A0010":"广告编号为空",
        "A0011":"公告编号为空",
        "A0012":"消息推送失败",
        "A0013":"公告发送状态修改异常",
        "A0014":"公告标题为空",
        "A0015":"公告内容为空",
        "A0016":"公告标题字符格式错误",
        "A0017":"公告内容不能超过1500个字",
        "A0018":"公告编号数组为空",
        "A0019":"置顶状态为空",
        "A0020":"置顶状态格式错误",
        "A0021":"图片大小不能超过20M",
        "A0022":"查询标题格式错误",
        "A0023":"文件为空",
        "A0024":"用户编号为空",
        "A0025":"该广告已经展示首页,请刷新页面重新操作",
        "A0026":"该广告已取消展示首页,请刷新页面重新操作",
        "A0027":"该广告已经被删除,请刷新页面重新操作",
        "A0028":"该公告已经被删除,请刷新页面重新操作",
        "A0029":"最多展示六条广告",
        "A0030":"置顶状态为空",
        "A0031":"置顶状态错误",
        "A0033":"该公告已经被置顶，请刷新页面重新操作",
        "A0034":"该公告已被删除，请刷新页面重新操作",
        "A0035":"该公告已经被取消置顶，请刷新页面重新操作",

        "A1101":"系统错误，操作失败，请稍后重试。如果疑问依然未能解决，请联系管理员处理，谢谢！",  //活动编号为空
        "A1102":"活动已被删除",
        "A1103":"活动审核未通过",
        "A1104":"活动已经被置顶",
        "A1105":"活动已经被取消置顶",
        "A1106":"活动置顶个数超过限定的3个",
        "A1107":"活动标题格式错误",
        "A1108":"时间格式错误，正确的格式为：yyyy-MM-dd hh:mm:ss",
        "A1109":"开始时间不能大于结束时间",
        "A1110":"发布人昵称格式错误"
    },
    "B":{
        "B0001":"楼宇id为空",
        "B0002":"楼宇名称为空",
        "B0003":"楼宇格式错误",
        "B0004":"楼宇描述格式错误",
        "B0005":"楼宇名称已存在",
        "B0006":"单元id为空",
        "B0007":"单元名称为空",
        "B0008":"单元格式错误",
        "B0009":"该单元/楼座名称已存在",
        "B0010":"当前楼宇下存在房屋不能删除",
        "B0011":"当前楼宇已被删除，请刷新页面重新操作",
        "B0012":"单元/楼座已被删除，请刷新页面重新操作",
        "B0013":"该单元下存在房屋，请重新操作",
    },
    "C":{
        "C0010":"token超出范围",

        "C0100":"区域名称为空",
        "C0101":"区域名称格式错误",
        "C0102":"区域名称重复",
        "C0103":"区域下有类型",
        "C0104":"保洁类型为空",
        "C0105":"保洁类型格式错误",
        "C0106":"同一区域的保洁类型重复",
        "C0107":"保洁类型下有保洁内容",
        "C0108":"保洁区域Id为空",
        "C0109":"保洁区域已被删除",
        "C0110":"保洁类型Id为空",
        "C0111":"保洁类型被删除",
        "C0112":"所在位置为空",
        "C0113":"所在位置格式错误",
        "C0114":"保洁周期为空",
        "C0115":"保洁内容为空",
        "C0116":"保洁内容格式错误",
        "C0117":"起始时间不能大于结束时间",
        "C0118":"保洁编号格式错误",
        "C0119":"时间格式错误",
        "C0120":"保洁内容Id为空",
        "C0121":"保洁内容已删除"
    },
    "D":{
        "D0001":"系统错误，操作失败，请稍后重试。如果疑问依然未能解决，请联系管理员处理，谢谢！",
        "D0002":"系统错误，操作失败，请稍后重试。如果疑问依然未能解决，请联系管理员处理，谢谢！",
        "D0003":"系统错误，操作失败，请稍后重试。如果疑问依然未能解决，请联系管理员处理，谢谢！",
        "D0004":"系统错误，操作失败，请稍后重试。如果疑问依然未能解决，请联系管理员处理，谢谢！",
        "D0005":"结束时间不能早于起始时间",
        "D0006":"系统错误，操作失败，请稍后重试。如果依然未能解决，请联系管理员处理，谢谢！",
        "D0007":"交易已被删除，请刷新页面重新操作",
        "D0008":"系统错误，操作失败，请稍后重试。如果依然未能解决，请联系管理员处理，谢谢！",
        "D0009":"系统错误，操作失败，请稍后重试。如果依然未能解决，请联系管理员处理，谢谢！",
        "D0010":"该交易已经置顶，请刷新页面重新操作",
        "D0011":"该交易已经取消置顶，请刷新页面重新操作",
        "D0012":"最多只能置顶三项交易",
        "D0013":"最高价格不能低于最低价格",
        "D0014":"该交易已被驳回,请刷新页面重新操作",
        // "D0010":"输入标题格式错误",

        "D0100":"类型ID为空",
        "D0101":"该资料类别已被删除，请刷新页面重新操作",
        "D0102":"资料ID为空",
        "D0103":"该资料已被删除，请刷新页面重新操作",
        "D0104":"类别名称为空,请重新操作",
        "D0105":"类别名称格式错误",
        "D0106":"资料类别已存在，请重新输入",
        "D0107":"资料名称为空",
        "D0108":"资料名称格式错误",
        "D0109":"该类别下已存在此资料，请重新输入",
        "D0110":"输入的资料内容过长",
        "D0111":"文件为空",
        "D0112":"文件格式错误",
        "D0113":"文件大小超过20M",
        "D0114":"资料内容不能为空",

        "DE001":"装修备注不能超过500个字",
        "DE002":"系统错误，操作失败，请稍后重试。如果依然未能解决，请联系管理员处理，谢谢！",   //房屋id不能为空
        "DE003":"装修公司不能为空",
        "DE004":"装修开始时间不能为空",
        "DE005":"装修周期不能为空",
        "DE006":"系统错误，操作失败，请稍后重试。如果依然未能解决，请联系管理员处理，谢谢！",  //装修申请记录id不能为空
        "DE007":"装修状态不能为空",
        "DE008":"拒绝理由不能为大于500个字",
        "DE009":"物业备注不能为大于500个字",
        "DE010":"取消理由不能为大于500个字",
        "DE013":"您选择的房屋已被删除",
        "DE014":"此装修申请单状态已变更，请刷新页面重新操作", //"此装修申请单状态已变更，请重新刷新列表查看",
        "DE015":"楼宇已被删除，请刷新页面重新操",
        "DE016":"单元/楼座已被删除，请刷新页面重新操",

    },
    "F":{
        "F0001":"反馈人昵称格式错误",
        "F0002":"App版本格式错误",
        "F0003":"时间格式错误，正确的格式为：yyyy-MM-dd hh:mm:ss",
        "F0004":"开始时间不能大于结束时间",
        "F0005":"反馈编号不能为空",
        "F0006":"反馈已被删除，请刷新页面重新操作",

        "F0051":"房屋ID为空",
        "F0052":"收费类型为空",
        "F0053":"该房屋被删除,请重新操作",
        "F0054":"房屋交付时间不能为空",
        "F0055":"没有该收费类型的收费项",
        "F0056":"该房屋没有绑定收费项,请重新操作",
        "F0057":"收费项ID为空",
        "F0058":"月数为空",
        "F0059":"该收费项被删除,请重新操作",
        "F0060":"该车位(购买)已被删除,请重新操作",
        "F0061":"该车位(租赁)已被删除,请重新操作",
        "F0062":"该房屋信息已更改，请重新操作",

        // "F10009":"账单ID为空",
        "F0063":"账单未缴费",
        "F0064":"收据已提供,请刷新页面重新操作",
        "F0065":"app用户已索要收据，请刷新页面重新操作",
        "F0066":"收据状态为空",
        "F0067":"收据状态格式错误",

        "F10001":"房屋号字数字数不能大于6位且不能包含特殊字符（英文\\<>\\'\"%）",
        "F10002":"户主姓名字数不能大于10位且不能包含特殊字符（英文\\<>\'\"%）",
        "F10003":"出账开始时间格式必须满足yyyy-MM-dd",
        "F10004":"出账结束时间格式必须满足yyyy-MM-dd",
        "F10014":"出账开始时间不能大于出账结束时间",
        "F10005":"系统错误，操作失败，请稍后重试。如果疑问依然未能解决，请联系管理员处理，谢谢！",   //楼宇ID为空
        "F10006":"系统错误，操作失败，请稍后重试。如果疑问依然未能解决，请联系管理员处理，谢谢！",   //单元ID为空
        "F10016":"该楼宇不存在,请刷新页面重新操作",
        "F10017":"该单元/楼座不存在,请刷新页面重新操作",
        "F10008":"（缴费）收费状态不在本系统范围内",
        "F10009":"系统错误，操作失败，请稍后重试。如果疑问依然未能解决，请联系管理员处理，谢谢！", //楼宇ID为空
        "F10010":"选中的账单中含非欠缴费账单，请选择欠缴费账单",
        "F10011":"选中的账单不是同一个房屋的账单，请选择同一个房屋下的账单",
        "F10013":"账单已被删除",
        "F10012":"交钱（缴费）方式不在系统范围内",
        "F10015":"选中的账单含有欠缴费账单，请选择已缴费账单",
        "F10019":"您选择缴费的账单已经超过5分钟有效时间，请重新生成账单",
        "F10018":"您选择缴费的账单为待支付状态，不能缴费",
        "F10020":"选择的账单生成的流水号不唯一，报错",
        "F10021":"生成缴费流水号失败",
        "F10022":"选中的账单，有部分被删除",
        "F10023":"您选择的账单无户主信息",
        "F10024":"您选择的账单有部分无户主信息",
        "F10025":"您选择的账单有部分账单未逾期，请选择逾期账单",
        "F10026":"您选择的账单未逾期，请选择逾期的账单",
        "F10027":"您选择的账单已经缴费",
        "F10028":"您选择的账单有部分账单已经缴费完，请重新选择账单",

        "F20001":"房屋id为空",
        "F20002":"房屋认证状态为空",
        "F20004":"房屋饲养宠物状态为空",
        "F20005":"房屋饲养宠物状态不正确",
        "F20006":"户主姓名为空",
        "F20007":"特殊字符（英文\\<>\'\"%），并前后去空格",
        "F20008":"户主联系方式为空",
        "F20009":"户主联系方式格式为13|14|15|17|18开头，长度为11位纯数字，并前后去空格",
        "F20010":"户主的状态为空",
        "F20014":"户主的状态不正确",
        "F20011":"户主籍贯长度为1-50个字且不能包含特殊字符（英文\\<>\'\"%），并前后去空格",
        "F20013":"户主民族长度为1-5个汉字且不能包含特殊字符（英文\\<>\'\"%），并前后去空格",
        "F20015":"该户主宗教信仰类型系统不存在",
        "F20016":"房屋出租状态为空",
        "F20017":"房屋出租状态不正确",
        "F20018":"租户姓名为空",
        "F20019":"租户姓名长度为1-10个字且不能包含特殊字符（英文\\<>\'\"%），并前后去空格",
        "F20020":"租户联系方式为空",
        "F20021":"租户联系方式格式为13|14|15|17|18开头，长度为11位纯数字，并前后去空格",
        "F20023":"租户籍贯长度为1-50个字且不能包含特殊字符（英文\\<>\'\"%），并前后去空格",
        "F20025":"租户民族长度为1-5个字且不能包含特殊字符（英文\\<>\'\"%），并前后去空格",
        "F20026":"您选择的租户宗教信仰类型系统不存在",
        "F20027":"楼宇id为空",
        "F20028":"租户id为空",
        "F20029":"成员姓名为空",
        "F20030":"成员姓名长度为1-10个字且不能包含特殊字符（英文\\<>\'\"%），并前后去空格",
        "F20031":"成员联系方式为空",
        "F20032":"成员联系方式格式为13|14|15|17|18开头，长度为11位纯数字，并前后去空格",
        "F20033":"成员籍贯长度为1-50个字且不能包含特殊字符（英文\\<>\'\"%），并前后去空格",
        "F20034":"成员民族长度为1-5个汉字且不能包含特殊字符（英文\\<>\'\"%），并前后去空格",
        "F20035":"该成员宗教信仰类型系统不存在",
        "F20038":"户主已经存在",
        "F20039":"成员已存在",
        "F20040":"房屋必须是出租状态，才能添加租户信息",
        "F20041":"该房屋已被删除，请刷新页面重新操作",
        "F20042":"该租户已存在",
        "F20043":"该帐号已为户主的登录账号，请重新输入"
    },
    "G":{
        "G0001":"名称格式错误",
        "G0002":"名称不能超过20字符",
        "G0003":"名称不能为空",
        "G0004":"户型名称已存在",
        "G0005":"功能区域名称已存在",
        "G0006":"户型ID为空",
        "G0007":"户型下存在房屋不能删除",
        "G0008":"功能区域ID为空",
        "G0009":"户型已被删除",
        "G0010":"户型建材ID为空",
        "G0011":"建材ID为空",
        "G0012":"该建材已添加",
        "G0013":"关键词格式错误",
        "G0014":"关键词不能超过20字符",
        "G0015":"功能区域名称格式错误",
        "G0016":"功能区域名称不能超过20字符",
        "G0017":"功能区域名称不能为空",
        "G0018":"建材已被删除",
        "G0019":"功能区域名称不能为”所有”和”全户型”",
        "G0021":"功能区域已被删除",
        "G0022":"您所选的建材有被删除",
        "G0023":"部分功能区域被删除"
    },
    "H":{
        "H0002":"单元楼宇不匹配",
        "H0003":"房号为空",
        "H0004":"房号格式错误",
        "H0005":"该房屋已存在",
        "H0006":"房屋描述字数超过最大限度",
        "H0007":"房屋编号为空",
        "H0008":"房屋图纸类型为空",
        "H0009":"文件标识为空",
        "H0010":"预览图片格式错误",
        "H0011":"CAD文件格式错误",
        "H0012":"预览图片大小不能超过5M",
        "H0013":"CAD文件大小不能超过5M",
        "H0014":"导入的文件内容不能为空",
        "H0015":"Excel文件格式错误",
        "H0016":"Excel文件大小超过15M",
        "H0019":"该预览图已被删除",
        "H0020":"该CAD文件已被删除",
        "H0021":"通知发送失败",
        "H0022":"该楼宇不存在，请刷新页面重新操作",
        "H0023":"该单元/楼座不存在，请刷新页面重新操作",
        "H0024":"该户型不存在",
        "H0025":"所选房屋中有被删除，请刷新页面重新操作",
        "H0026":"房屋图纸编号为空",
        "H0027":"文件读取失败",
        "H0028":"请选择楼宇",
        "H0029":"请使用系统提供的Excel模板",
        "H0034":"建筑面积不能小于套内面积,请重新操作",
        "H1015":"系统错误，操作失败，请稍后重试。如果疑问依然未能解决，请联系管理员处理，谢谢！",   //认证申请Id为空
        "H1016":"审核已结束,请刷新页面重新操作",
        "H1017":"请求已撤销,请刷新页面重新操作",
        "H1018":"请求已删除,请刷新页面重新操作",
        "H1019":"审核意见不许为空",
        "H1020":"审核内容长度超过限制",
        "H1021":"审核结果不许为空",
        "H1050":"认证信息不存在",
        "H1051":"申请人姓名不能超过20个字",
        "H1052":"申请人姓名不能包含特殊字符",
        "H1053":"房屋信息不能超过50个字",
        "H1054":"房屋信息不能包含特殊字符",
        "H0030":"交付时间不能为空",
        "H0031":"交付时间格式错误",
        "H0032":"建筑面积不能为空",
        "H0033":"套内面积不能为空",
        "H0035":"建筑面积格式错误",
        "H0036":"套内面积格式错误",
        "H0037":"Zip包格式错误",
        "H0038":"Zip包大小错误",
        "H0039":"您没有按照系统模板进行打包压缩",
        "H0040":"压缩包中不能包含除表格（.xls）和图片(.bmp|.jpg|.jpeg|.png|.dwt)的其他文件",
        "H0041":"压缩包中应有且只有一个.xls文件",
        "H0042":"请上传指定格式（.jpg|.jpeg|.bmp|.png|.dwt）的图片",
        "H0043":"excel文件内容不能为空",
        "H0044":"户主搜索条件出错",
        "H0045":"购买的车位数过多",
        "H0046":"租赁的车位数过多",
        "H0047":"购买的车位号已存在",
        "H0048":"租赁的车位号已存在",
        "H0049":"车位号格式错误",
        "H0050":"车牌号格式错误",
        "H0051":"展示顺序格式错误",
        "H0052":"房屋序号不能为空"
    },
    "I":{
        "I0001":"房号长度超过6个字符",
        "I0002":"房号格式错误",
        "I0003":"客户名称超过10个字符",
        "I0004":"客户名称格式错误",
        "I0005":"时间格式错误",
        "I0006":"结束时间不能早于起始时间",
        "I0007":"楼宇id为空",
        "I0008":"该楼宇不存在，请刷新页面重新操作",
        "I0009":"该单元/楼座不存在，请刷新页面重新操作",

    },
    "J":{
        "J0001":"关键词格式错误",
        "J0002":"建材类型名称为空",
        "J0025":"材料编号集合为空",
        "J0003":"材料名称为空",
        "J0004":"材料名称格式不正确",
        "J0005":"材料名称已存在",
        "J0006":"型号描述字数超过最大限制",
        "J0007":"品牌描述字数超过最大限制",
        "J0008":"规格描述字数超过最大限制",
        "J0009":"产地描述字数超过最大限制",
        "J0010":"生产日期格式不正确",
        "J0011":"截止日期格式不正确",
        "J0012":"自定义参数名称为空",
        "J0013":"自定义参数名称格式不正确",
        "J0014":"自定义参数名称已存在",
        "J0015":"自定义参数内容为空",
        "J0016":"自定义参数内容字数超过最大限制",
        "J0022":"上传图片为空",
        "J0023":"头像格式不正确",
        "J0024":"建材图片大小不能超过5M",
        "J0017":"zip文件不能为空",
        "J0018":"压缩文件不是zip文件格式",
        "J0019":"zip文件的大小不能超过40M",
        "J0020":"压缩包中只能含有一个excel表格",
        "J0021":"请在zip压缩包中放入.xls格式的表格",
        "J0026":"您没有按照系统模板进行打包压缩",
        "J0027":"zip里是空的",
        "J0028":"压缩包里含有文件夹",
        "J0029":"请在zip压缩包中放入.xls格式的表格",
        "J0030":"zip中表格数据不能为空",
        "J0031":"材料类型输入不正确",
        "J0032":"EXCEL文件里图片名称不合法",
        "J0033":"ZIP包内未找到该名称的图片文件",
        "J0034":"建材已被删除,请刷新页面重新操作",
        "J0035":"生产日期不能大于截止日期",
        "J0036":"品牌名称错误",
        "J0037":"建材型号错误",
        "J0038":"材料类型名称错误",
    },
    "K":{
        "K0012":"管理员登录账号为空"
    },
    "L":{
        "L0001":"账号密码错误",
        "L0003":"验证码错误",
        "LE001":"不能出现\%<>’” 字符（英文），并保证前后去空格，名称长度为1-50字符",
        "LE002":"不能出现\%<>’” 字符（英文），并保证前后去空格，名称长度为1-20字符",
        "LE003":"对接人电话格式错误",
        "LE004":"不能出现\%<>’” 字符（英文），并保证前后去空格，长度为1-50字符",
        "LE005":"不能为空",
        "LE006":"单价不能为0~100W,可以为小数",
        "LE007":"计租时间必须大于等于合同签订时间",
        "LE008":"月数0~1000",
        "LE009":"不能出现\%<>’” 字符（英文），并保证前后去空格，名称长度为1-30字符",
        "LE010":"单价不能为0~1000,可以为小数",
        "LE011":"长度最大限制20",
        "LE012":"不能添加过期的租赁合同",
        "LE013":"时间不能为空",
        "LE014":"房屋编号错误",
        "LE015":"公司名称错误",
        "LE016":"参数错误",
        "LE017":"同一房屋的租赁时间存在冲突",
        "LE018":"文件格式错误",
        "LE019":"文件只能为pdf",
        "LE020":"文件最大50M",
        "LE021":"该房屋已被删除，请重新操作",
    },
    "M":{
        "M0001":"账号为空",
        "M0002":"账号格式错误",
        "M0003":"账号错误",
        "M0004":"账号已存在，请重新操作",
        "M0005":"账号或密码错误",
        "M0006":"密码为空",
        "M0007":"密码格式错误",
        "M0008":"密码错误",
        "M0009":"旧密码错误",
        "M0010":"两次密码输入不一致",
        "M0011":"昵称已存在，请重新操作",
        "M0012":"管理员昵称为空",
        "M0013":"管理员昵称格式错误",
        "M0016":"adminId为空",
        "M0017":"管理员角色为空",
        "M0018":"角色不存在，请刷新页面重新操作"
    },
    "N":{
        "N0001":"帖子标题不能超过100个字，且不能包含特殊字符（英文\\<>\'\"%）",
        "N0002":"发帖人昵称不能超过15个字，且不能包含特殊字符（英文\\<>\'\"%）",
        "N0003":"发帖开始时间格式必须满足yyyy-MM-dd hh:mm:ss",
        "N0004":"发帖结束时间格式必须满足yyyy-MM-dd hh:mm:ss",
        "N0005":"发帖开始时间不能大于结束时间",
        "N0006":"帖子审核状态不能包含特殊字符（英文\\<>\'\"%）且长度为1",
        "N0007":"系统错误，操作失败，请稍后重试。如果疑问依然未能解决，请联系管理员处理，谢谢！",  //帖子id为空
        "N0008":"该帖子已被删除",
        "N0009":"帖子驳回意见不能为空",
        "N0010":"帖子驳回意见不能超过100个字",
        "N0011":"楼层发布人即层主昵称字数不能大于15位，且不能包含特殊字符（英文\<>\'\"%）",
        "N0012":"楼层发表开始时间格式必须满足yyyy-MM-dd hh:mm:ss",
        "N0013":"楼层发结束时间格式必须满足yyyy-MM-dd hh:mm:ss",
        "N0014":"楼层发表开始时间不能大于结束时间",
        "N0015":"楼层审核状态不能包含特殊字符（英文\<>\'\"%）且长度为1",
        "N0016":"系统错误，操作失败，请稍后重试。如果疑问依然未能解决，请联系管理员处理，谢谢！",  //楼层id为空
        "N0017":"该楼层已被删除，请刷新页面重新操作",
        "N0018":"楼层驳回意见不能为空",
        "N0019":"楼层驳回意见不能超过100个字",
        "N0020":"回复标题不能超过100个字，且不能包含特殊字符（英文\<>\'\"%）",
        "N0021":"回复人昵称字数不能大于15位，且不能包含特殊字符（英文\<>\'\"%）",
        "N0022":"回复开始时间格式必须满足yyyy-MM-dd hh:mm:ss",
        "N0023":"回复发结束时间格式必须满足yyyy-MM-dd hh:mm:ss",
        "N0024":"回复开始时间不能大于结束时间",
        "N0025":"系统错误，操作失败，请稍后重试。如果疑问依然未能解决，请联系管理员处理，谢谢！",  //回复id为空
        "N0026":"该回复已被删除，请刷新页面重新操作",
        "N0027":"回复审核状态不能包含特殊字符（英文\<>\'\"%）且长度为1",
        "N0028":"回复驳回意见不能为空",
        "N0029":"回复驳回意见不能超过100个字",
        "N0030":"活动标题不能超过100个字，且不能包含特殊字符（英文\<>\'\"%）",
        "N0032":"活动发布开始时间格式必须满足yyyy-MM-dd hh:mm:ss",
        "N0033":"活动发布结束时间格式必须满足yyyy-MM-dd hh:mm:ss",
        "N0034":"活动发布开始时间不能大于结束时间",
        "N0035":"活动审核状态不能包含特殊字符（英文\<>\'\"%）且长度为1",
        "N0036":"活动状态格式不能包含特殊字符（英文\<>\'\"%）且长度为1",
        "N0037":"系统错误，操作失败，请稍后重试。如果疑问依然未能解决，请联系管理员处理，谢谢!",   //活动id为空
        "N0038":"该活动已被删除，请刷新页面重新操作",
        "N0039":"活动驳回意见不能为空",
        "N0040":"活动驳回意见不能超过100个字",
        "N0041":"交易物品标题不能超过100个字，且不能包含特殊字符（英文\<>\'\"%）",
        "N0042":"交易物品发布人昵称字数不能大于15位，且不能包含特殊字符（英文\<>\'\"%）",
        "N0043":"交易物品发布开始时间格式必须满足yyyy-MM-dd hh:mm:ss",
        "N0044":"交易物品发布结束时间格式必须满足yyyy-MM-dd hh:mm:ss",
        "N0045":"交易物品发布开始时间不能大于结束时间",
        "N0046":"交易物品状态不能包含特殊字符（英文\<>\'\"%）且长度为1",
        "N0047":"交易物品审核状态不能包含特殊字符（英文\<>\'\"%）且长度为1",
        "N0048":"系统错误，操作失败，请稍后重试。如果疑问依然未能解决，请联系管理员处理，谢谢!",   //交易物品id为空
        "N0049":"该交易已被删除，请刷新页面重新操作",
        "N0050":"交易物品驳回意见不能为空",
        "N0051":"交易物品驳回意见不能超过100个字",
        "N0052":"交易留言人昵称字数不能大于15位，且不能包含特殊字符（英文\<>\'\"%）",
        "N0053":"交易留言发表开始时间格式必须满足yyyy-MM-dd hh:mm:ss",
        "N0054":"交易留言发表结束时间格式必须满足yyyy-MM-dd hh:mm:ss",
        "N0055":"交易留言发表开始时间不能大于结束时间",
        "N0056":"交易留言审核状态不能包含特殊字符（英文\<>\'\"%）且长度为1",
        "N0057":"系统错误，操作失败，请稍后重试。如果疑问依然未能解决，请联系管理员处理，谢谢!",   //交易留言id为空
        "N0058":"该交易留言已被删除，请刷新页面重新操作",
        "N0059":"交易留言驳回意见为空",
        "N0060":"交易留言驳回意见字数不能大于100位",
        "N0061":"活动发布人被删除",
        "N0062":"交易物品发布人被删除",
        "N0063":"交易留言发表人被删除",
        "N0064":"审核状态的标识符不正确",
        "N0065":"交易物品的价格必须输入大于等于0的正整数",
        "N0066":"系统错误，操作失败，请稍后重试。如果疑问依然未能解决，请联系管理员处理，谢谢!"  , //活动发布人id为空
        "N0067":"所选帖子中有被删除，请刷新页面重新操作",
        "N0068":"所选楼层中有被删除，请刷新页面重新操作",
        "N0069":"所选回复中有被删除，请刷新页面重新操作",
        "N0070":"所选活动中有被删除，请刷新页面重新操作",
        "N0071":"所选交易中有被删除，请刷新页面重新操作",
        "N0072":"所选交易留言中有被删除，请刷新页面重新操作",
        "N0073":"交易物品最低价格大于最高价格",
    },
    "P":{
        "P0001":"图片不能为空",
        "P0002":"系统错误，操作失败，请稍后重试。如果疑问依然未能解决，请联系管理员处理，谢谢！",   //图片id不能为空
        "P0003":"图片格式不符合要求",
        "P0004":"图片大小不能超过20M",
        "P0005":"图片名称不能超过120个字!"
    },
    "R":{
        "R0002":"举报编号不能为空",
        "R0004":"举报类型不能为空",
        "R0006":"处理结果不能为空",
        "R0007":"处理结果不正确",
        "R0008":"审核意见不能为空",
        "R0009":"审核意见不能超过100个字",

        "R0100":"角色名称不能为空",
        "R0101":"角色名称格式错误",
        "R0102":"角色描述不能超过100字",
        "R0103":"角色名称已存在",
        "R0104":"权限不能为空",
        "R0105":"角色名称不能为admin",
        "R0106":"角色ID不能为空",
        "R0107":"角色已关联管理员，删除失败",
        "R0108":"关键词格式错误",
        "R0109":"关键词不能超过20字",
        "R0110":"角色不存在，请刷新页面重新操作",
        "R0211":"该房屋不存在，请重新操作",

        "R0200"	:"房号长度超过6个字符",
        "R0201":"房号格式错误",
        "R0202":"客户名称超过10个字符",
        "R0203"	:"客户名称格式错误",
        "R0204":"时间格式错误",
        "R0205":"结束时间不能早于起始时间",
        "R0206":"报修单号长度超过22个字",
        "R0207":"报修单号格式错误",
        "R0208":"楼宇id为空",
        "R0209":"维修单号为空",
        "R0210":"维修单已被删除，请刷新页面重新操作",
        "R0212":"报修人姓名为空",
        "R0213":"报修人姓名格式错误",
        "R0214":"报修人联系电话为空",
        'R0215':'报修人联系电话格式错误',
        'R0216':"维修内容长度超过100个字符",
        'R0217':"维修人员姓名为空",
        'R0218':"维修人员姓名格式错误",
        'R0219':"维修人员联系电话为空",
        'R0220':"维修人员联系电话格式错误",
        'R0221':"预约上门维修时间格式错误",
        'R0222':"维修收费标准过长",
        'R0223':"文件为空",
        'R0224':"文件原始文件名长度过长",
        'R0225':"文件大小超过20M",
        'R0226':"文件格式错误",
        'R0227':"维修人ID为空",
        'R0228':"维修人已被删除,请刷新页面重新操作",
        'R0229':"该维修单已被接单或已完成,请刷新页面重新操作",
        'R0230':"该维修单已完成,请刷新页面重新操作",
        'R0231':"请选择报修区域",
        'R0232':"请选择报修类别",
        'R0233':"房屋不能为空",
        'R0234':"该楼宇不存在,请刷新页面重新操作",
        'R0235':"该单元/楼座不存在,请刷新页面重新操作",
        'R0236':"单元被删除,请刷新页面重新操作",
        'R0237':"维修单被取消,请刷新页面重新操作",
        'R0238':"员工编号格式错误",
        'R0239':"员工姓名格式错误",
        'R0240':"员工手机号格式错误",
        'R0241':"选中的部门已被删除",
        'R0249':"支付提醒天数为空",
        'R0248':"超期提醒天数为空",
        'R0250':"配置名为空",

    },
    "S":{
        "S0001":"计费方式不存在,请刷新页面重新操作",
        "S0002":"项目名称不合法,请刷新页面重新操作",
        "S0003":"价格格式不正确,请刷新页面重新操作",
        "S0014":"计费方式为空,请刷新页面重新操作",


        "S0017":"收费周期为空,请刷新页面重新操作",
        "S0004":"收费周期不合法,请刷新页面重新操作",
        "S0005":"滞纳金率格式不合法,请刷新页面重新操作",
        "S0019":"收费项类型为空,请刷新页面重新操作",
        "S0020":"缴费周期为空,请刷新页面重新操作",
        "S0007":"缴费周期不合法,请刷新页面重新操作",
        "S0006":"收费项类型不存在,请刷新页面重新操作",
        "S0018":"滞纳金率为空,请刷新页面重新操作",

        "S0008":"收费项目id为空",
        "S0009":"该收费项目已被删除,请刷新页面重新操作",
        "S0010":"存在楼宇已使用该类型的收费项目,请刷新页面重新操作",
        "S0011":"计费年月满足格式yyyy-MM",
        "S0012":"该收费项目已被激活,请刷新页面重新操作",
        "S0013":"存在楼宇已被删除,请重新操作",
        "S0021":"计费年月必须是当前年月的之后的年月",
        "S0022":"本机时间与标准时间不一致",
        "S0023":"楼宇不能为空,请重新操作",
        "S0024":"选中时选中的楼宇有被删除,请重新操作",
        "S0025":"收费标准内容过长",
        "S0026":"选择的楼宇有部分已经应用了收费项目,请重新操作",
        "S0027":"项目名称重复,请重新操作",
        "S0028":"该收费项目已经关联账单,请重新操作",
        "S0029":"存在收费项目已经关联账单,请重新操作",
        "S0030":"能耗费最多1条,请重新操作",
        "S0031":"公摊水电费最多1条,请重新操作",
        "S0032":"收费时间为空,请重新操作",
        "S0033":"该收费项目未到出账时间,请重新操作",
        "S0034":"系统内无房屋信息，请添加房屋后重新操作",
        "S0035":"系统内无楼宇信息，请添加楼宇后重新操作",
        "S0036":"该时间段已经出过账单",
    },
    "T":{
        "T0001": "任务类型为空",
        "T0002": "任务类型格式错误",
        "T0003": "任务类型已存在",
        "T0004": "任务类型被删除",
        "T0005": "工作概述为空",
        "T0006": "工作概述格式错误",
        "T0007": "指派人员为空",
        "T0008": "指派人员被删除",
        "T0009": "指派人员格式错误",
        "T0010": "时间格式错误",
        "T0011": "起始时间大于结束时间",
        "T0012": "任务被删除",
        "T0013": "该任务状态为已完成，不能进行编辑",
        "T0014": "该任务状态为进行中，不能进行编辑",
        "T0015": "员工姓名格式错误",
        "T0016": "员工编号格式错误",
        "T0017": "员工手机号格式错误",
        "T0018": "发布人格式错误",
        "T0019": "任务状态待接受",
        "T0020": "该任务不能重复指派给该人员",
        "T0021": "任务编号格式错误",
        "T0023":"操作异常",
        "T0030":"楼层被删除",
        "T0050":"标题格式错误",
        "T0051":"标题不能超过100字",
        "T0052":"昵称格式错误",
        "T0053":"昵称不能超过15字",
        "T0054":"筛选的时间格式错误",
        "T0055":"帖子状态不正确",
        "T8080":"参数为空",
        "T0024":"该任务状态为超时未完成，不能进行编辑",
    },
    "U":{
        "U1001":"账号为空",
        "U1002":"账号格式错误",
        "U1003":"账号错误",
        "U1004":"账号已存在",
        "U1005":"Token过期",
        "U1006":"头像大小超过限制",
        "U1007":"头像格式错误",
        "U1008":"部分用户被删除，请刷新页面重新操作",
        "U1009":"昵称为空",
        "U1010":"昵称格式错误",
        "U1011":"昵称已存在",
        "U1012":"删除用户失败",
        "U1013":"参数错误",
        "U1015":"关键字为空",
        "U1016":"用户id为空",
        "U1017":"关键字查询不符合输入要求",
        "U1018":"查询失败",
        "U1019":"用户性别为空",
        "U1020":"用户未登录",
        "U1021":"头像为空",
        "U1022":"用户不存在，请刷新页面重新操作",
        "U1023":"用户状态为空"
    },
    "W":{
        "W0001":"敏感词不能为空",
        "W0002":"敏感词不能含有\'\"<>%\\",
        "W0003":"敏感词已存在",
        "W0004":"文件不能为空",
        "W0005":"文件格式错误，只能上传txt",
        "W0006":"txt文件大小不能超过64KB",
        "W0007":"关键词格式错误",
        "W0008":"系统错误，操作失败，请稍后重试。如果疑问依然未能解决，请联系管理员处理，谢谢！",  //敏感词编号不能为空
        "W0009":"敏感词不能超过30个字",
        "W0010":"关键词不能超过30个字",
    },
    "V":{
        "V0001":"版本id不能为空",
        "V0002":"版本名称不能为空",
        "V0003":"版本号不能为空",
        "V0004":"版本类型不能为空",
        "V0005":"是否强制升级不能为空",
        "V0006":"版本名称格式错误",
        "V0007":"版本号格式错误",
        "V0008":"版本文件格式错误",
        "V0009":"版本描述格式错误",
        "V0010":"版本文件过大",
        "V0011":"版本名称已存在",
        "V0012":"版本号已存在",
        "V0013":"此版本已被删除，请刷新页面重新操作",
        "V0014":"版本文件不能为空",
        "V0015":"版本文件已存在"
    },
    "X":{
        "X1001":"设备类型为空",
        "X1002":"巡设备类型格式错误",
        "X1003":"维修内容长度超长",
        "X1004":"维修费用格式错误",
        "X1005":"维修时间格式错误",
        "X1006":"类型名称已存在",
        "X1007":"设备类型已被删除,请重新操作",

        "X0001":"巡检设备ID为空",
        "X0002":"巡检设备编号为空",
        "X0003":"巡检设备编号格式不合法",
        "X0004":"巡检设备编号已存在",
        "X0005":"巡检设备名称为空",
        "X0006":"巡检设备名称不含特殊字符，50个字",
        "X0007":"巡检设备位置为空",
        "X0008":"巡检设备位置不合法",
        "X0009":"巡检设备内容为空",
        "X0010":"巡检设备内容超长",
        "X0011":"设备已被删除，请刷新页面重新操作",
        "X0012":"巡检记录id为空",
        "X0013":"巡检记录已不存在",
        "X0014":"巡检人员姓名不合法",
        "X0015":"巡检开始时间不合法",
        "X0016":"巡检结束时间不合法",
        "X0017":"巡检开始时间不能大于结束时间",
        "X0018":"保修截止日期不合法",
        "X0019":"设备生产厂商格式错误",
        "X0020":"生产厂商电话格式错误",
        "X0021":"设备维修厂商格式错误",
        "X0022":"维修厂商电话格式错误",
        "X0023":"您生产二维码的内容太长，无法生产二维码",
        "X0024":"设备生产日期格式不合法",
        "X0025":"保质期格式错误",
        "X0026":"该设备类型已绑定设备",
        "X0027":"质保期数量不能大于1000",

        "X2001":"设备类型空",
        "X2002":"时间格式错误",
        "X2003":"开始时间大于结束时间",
        "X2004":"设备编号格式错误",
        "X2005":"设备名称格式错误",
        "X2006":"设备位置格式错误",
        "X2007":"质保期为空",
        "X2008":"质保期格式错误",
        "X2009":"维保记录ID为空",
        "X2010":"维保记录被删除",
        "X2011":"设备已被删除，请刷新页面重新操作",
        "X2012":"设备编号和设备信息不匹配",   //"设备ID和NO不匹配",

        "X3001":"区域名称格式错误（不能含有特殊字符且长度不能大于50）",
        "X3002":"区域下签到地址格式错误（不能含有特殊字符且长度不能大于50）",
        "X3003":"区域名称重复",
        "X3004":"巡逻区域下签到地点重复",
        "X3005":"该巡逻区域已被删除",
        "X3006":"该签到地点已被删除",
        "X3007":"巡逻内容编号不合法",
        "X3008":"巡逻内容已被删除",
        "X3009":"定时发布巡逻任务时间数量不能超过10个",
        "X3010":"巡逻内容不能长度超过500",
        "X3011":"区域已经关联签到地址，不能删除区域",
        "X3012":"签到地址已经关联巡逻内容，不能删除签到地址",
        "X3013":"巡逻记录已被删除",
        "X3014":"定时任务的发布时间格式不对(格式：hh:mm）",
        "X3015":"已存在相同时间点的巡逻内容"

    },
}

//json 返回值
function successBack(json){
//操作成功
    var arrItem = ["A","B","C","D","F","G","H","J","K","L","M","N","P","R","T","U","W","V","S","I","X"];
    var errorMsg = '';
    if(json.code == "11111"){           //鉴权失败
        //window.location.href=path+'/login.html'
        var pathLogin = path.substring(0,path.lastIndexOf(path.split(":")[2])-1);
        window.location.href=pathLogin;
    }else if(json.code == "00000"){
        errorMsg = "操作成功!";
        BJUI.alertmsg('ok',errorMsg);
    }else if(json.code == "99999"){
        errorMsg = "操作失败!";
        BJUI.alertmsg('error', errorMsg);
    }else{                              //其他情况
        var item = json.code.substr(0,1);
        if(arrItem.indexOf(item) >=0){
            if(returnMsg[item][json.code]){
                errorMsg = returnMsg[item][json.code];
                BJUI.alertmsg('error', errorMsg);
            }
        }

    }
}
/*function successBack(json){
//操作成功
    var arrItem = ["A","B","C","D","F","G","H","J","K","L","M","N","P","R","T","U","W","V","S","I","X"];
    var errorMsg = '';
    if(json.code == "11111"){           //鉴权失败
        window.location.href=path+'/login.html'
    }else if(json.code == "00000"){
        if($(".divLoginError").length>0){
            $(".divLoginError").text(errorMsg).show().delay(2000).fadeOut(1500);
        }else{
            errorMsg = "操作成功!";
            BJUI.alertmsg('ok',errorMsg);
        }
    }else if(json.code == "22222"){
        if($(".divLoginError").length>0){
            $(".divLoginError").text(errorMsg).show().delay(2000).fadeOut(1500);
        }else {
            errorMsg = "该用户不存在!";
            BJUI.alertmsg('error', errorMsg);
        }
    }else if(json.code == "33333"){
        if($(".divLoginError").length>0){
            $(".divLoginError").text(errorMsg).show().delay(2000).fadeOut(1500);
        }else {
            errorMsg = "登录超时，请重新登录!";
            BJUI.alertmsg('error', errorMsg);
        }
    }else if(json.code == "T1010"){
        if($(".divLoginError").length>0){
            $(".divLoginError").text(errorMsg).show().delay(2000).fadeOut(1500);
        }else {
            errorMsg = "ID为空!";
            BJUI.alertmsg('error', errorMsg);

        }
    }else if(json.code == "T2020"){
        if($(".divLoginError").length>0){
            $(".divLoginError").text(errorMsg).show().delay(2000).fadeOut(1500);
        }else {
            errorMsg = "标题格式错误!";
            BJUI.alertmsg('error', errorMsg);

        }
    }else if(json.code == "T3030"){
        if($(".divLoginError").length>0){
            $(".divLoginError").text(errorMsg).show().delay(2000).fadeOut(1500);
        }else {
            errorMsg = "发布人格式错误!";
            BJUI.alertmsg('error', errorMsg);

        }
    }else if(json.code == "T4040"){
        if($(".divLoginError").length>0){
            $(".divLoginError").text(errorMsg).show().delay(2000).fadeOut(1500);
        }else {
            errorMsg = "开始时间格式错误!";
            BJUI.alertmsg('error', errorMsg);

        }
    }else if(json.code == "T5050"){
        if($(".divLoginError").length>0){
            $(".divLoginError").text(errorMsg).show().delay(2000).fadeOut(1500);
        }else {
            errorMsg = "结束时间格式错误!";
            BJUI.alertmsg('error', errorMsg);

        }
    }else if(json.code == "T6060"){
        if($(".divLoginError").length>0){
            $(".divLoginError").text(errorMsg).show().delay(2000).fadeOut(1500);
        }else {
            errorMsg = "开始时间不能大于结束时间!";
            BJUI.alertmsg('error', errorMsg);

        }
    }else if(json.code == "T7070"){
        if($(".divLoginError").length>0){
            $(".divLoginError").text(errorMsg).show().delay(2000).fadeOut(1500);
        }else {
            errorMsg = "未定义状态码错误!";
            BJUI.alertmsg('error', errorMsg);

        }
    }else if(json.code == "99999"){
        if($(".divLoginError").length>0){
            $(".divLoginError").text(errorMsg).show().delay(2000).fadeOut(1500);
        }else {
            errorMsg = "操作失败!";
            BJUI.alertmsg('error', errorMsg);

        }
    }else{                              //其他情况
        var item = json.code.substr(0,1);
        if(arrItem.indexOf(item) >=0){
            if(returnMsg[item][json.code]){
                errorMsg = returnMsg[item][json.code];
            }
        }

        if($(".divLoginError").length>0){
            $(".divLoginError").text(errorMsg).show().delay(2000).fadeOut(1500);
        }else {
            if(errorMsg == "帖子已被删除或审核不通过无法进行置顶"){
                BJUI.alertmsg('error', errorMsg);
                $.CurrentNavtab.find('#p_datagrid').datagrid('refresh', true)
            }else{
                if(errorMsg == "当前楼宇已被删除"){
                    BJUI.alertmsg('error', errorMsg);
                    //BJUI.navtab('refresh', 'buildingManage');
                    BJUI.navtab('switchTab', 'forum');
                }else {
                    if(errorMsg == "帖子已被删除"){
                        BJUI.alertmsg('error', errorMsg);
                        BJUI.navtab('closeTab', 'navtab_seePostDet');
                        BJUI.navtab('switchTab', 'forum');
                        $.CurrentNavtab.find('#p_datagrid').datagrid('refresh', true)
                    }else {
                        BJUI.alertmsg('error', errorMsg);
                    }
                }
            }

        }
    }
}*/

//编码
function htmlEncode(str) {
    var s = "";
    if (str.length == 0) return "";
    s = str.replace(/&/g, "&amp;");
    s = s.replace(/</g, "&lt;");
    s = s.replace(/>/g, "&gt;");
    s = s.replace(/ /g, "&nbsp;");
    s = s.replace(/\'/g, "&#39;");
    s = s.replace(/\"/g, "&quot;");
    s = s.replace(/\n/g, "<br>");
    return s;
}

//解码
function htmlDecode(str) {
    var s = "";
    if (str.length == 0) return "";
    s = str.replace(/&amp;/g, "&");
    s = s.replace(/&lt;/g, "<");
    s = s.replace(/&gt;/g, ">");
    s = s.replace(/&nbsp;/g, " ");
    s = s.replace(/&#39;/g, "\'");
    s = s.replace(/&quot;/g, "\"");
    s = s.replace(/<br>/g, "\n");
    return s;
}

function checkSearch(str) {
    var vkeyWords=/['"<>%\\]+/;
    if(str.length >30){
        BJUI.alertmsg('warn','搜索的关键字长度不能超过30，且不能含有\'\"<>%\\这些特殊字符！');
    }else if(vkeyWords.test(str)){
        BJUI.alertmsg('warn','搜索的关键字长度不能超过30，且不能含有\'\"<>%\\这些特殊字符！');
    }else{
        return str;
    }
}
function checkSearchs(str) {
    var vkeyWords=/['"<>%\\]+/;
    if(str.length >120){
        BJUI.alertmsg('warn','搜索的关键字长度不能超过120，且不能含有\'\"<>%\\这些特殊字符！');
    }else if(vkeyWords.test(str)){
        BJUI.alertmsg('warn','搜索的关键字长度不能超过120，且不能含有\'\"<>%\\这些特殊字符！');
    }else{
        return str;
    }
}

//手机预览效果
function checkInPhone(title,time,content) {
    var inPhoneHtml = '<div class="divCheckInPhoneBg"></div>';
    inPhoneHtml += '<div class="divCheckInPhone"><img src="images/icon_phone_bg.png"  style="height: 100%"/>';
    inPhoneHtml += '<div class="divCheckInPhoneMain" style="height: 100%"><div class="divCheckInPhoneMainScroll"><div class="divCheckInPhoneMainContent" style="max-height: 100%">';
    inPhoneHtml += '<div class="divCheckInPhone_title">'+title+'</div>';
    inPhoneHtml += '<div class="divCheckInPhone_time">&nbsp;'+'</div>';
    inPhoneHtml += '<div class="divCheckInPhone_content" style="height: 100%">'+content+'</div>';
    inPhoneHtml += '</div></div></div></div>';
    $("body").append(inPhoneHtml);

    $(".divCheckInPhoneBg").click(function () {
        $(".divCheckInPhoneBg,.divCheckInPhone").remove();
    });
}


//解析存储的emoji表情
function parse(arg) {
    if (typeof ioNull !='undefined') {
        return  ioNull.emoji.parse(arg);
    }
    return '';
};

//数组去重
function unique(array){
    var n = [];
    for(var i = 0; i < array.length; i++){
//如果当前数组的第i已经保存进了临时数组，那么跳过，
//否则把当前项push到临时数组里面
        if (n.indexOf(array[i]) == -1) n.push(array[i]);
    }
    return n;
}

//将数字金额转换为大写人民币汉字的方法
function convertCurrency(money) {
    //汉字的数字
    var cnNums = new Array('零', '壹', '贰', '叁', '肆', '伍', '陆', '柒', '捌', '玖');
    //基本单位
    var cnIntRadice = new Array('', '拾', '佰', '仟');
    //对应整数部分扩展单位
    var cnIntUnits = new Array('', '万', '亿', '兆');
    //对应小数部分单位
    var cnDecUnits = new Array('角', '分', '毫', '厘');
    //整数金额时后面跟的字符
    var cnInteger = '整';
    //整型完以后的单位
    var cnIntLast = '元';
    //最大处理的数字
    var maxNum = 999999999999999.9999;
    //金额整数部分
    var integerNum;
    //金额小数部分
    var decimalNum;
    //输出的中文金额字符串
    var chineseStr = '';
    //分离金额后用的数组，预定义
    var parts;
    if (money == '') { return ''; }
    money = parseFloat(money);
    if (money >= maxNum) {
        //超出最大处理数字
        return '';
    }
    if (money == 0) {
        chineseStr = cnNums[0] + cnIntLast + cnInteger;
        return chineseStr;
    }
    //转换为字符串
    money = money.toString();
    if (money.indexOf('.') == -1) {
        integerNum = money;
        decimalNum = '';
    } else {
        parts = money.split('.');
        integerNum = parts[0];
        decimalNum = parts[1].substr(0, 4);
    }
    //获取整型部分转换
    if (parseInt(integerNum, 10) > 0) {
        var zeroCount = 0;
        var IntLen = integerNum.length;
        for (var i = 0; i < IntLen; i++) {
            var n = integerNum.substr(i, 1);
            var p = IntLen - i - 1;
            var q = p / 4;
            var m = p % 4;
            if (n == '0') {
                zeroCount++;
            } else {
                if (zeroCount > 0) {
                    chineseStr += cnNums[0];
                }
                //归零
                zeroCount = 0;
                chineseStr += cnNums[parseInt(n)] + cnIntRadice[m];
            }
            if (m == 0 && zeroCount < 4) {
                chineseStr += cnIntUnits[q];
            }
        }
        chineseStr += cnIntLast;
    }
    //小数部分
    if (decimalNum != '') {
        var decLen = decimalNum.length;
        for (var i = 0; i < decLen; i++) {
            var n = decimalNum.substr(i, 1);
            if (n != '0') {
                chineseStr += cnNums[Number(n)] + cnDecUnits[i];
            }
        }
    }
    if (chineseStr == '') {
        chineseStr += cnNums[0] + cnIntLast + cnInteger;
    } else if (decimalNum == '') {
        chineseStr += cnInteger;
    }
    return chineseStr;
}

//左侧内容滚动条的高度
window.onload = window.onresize = function () {
    changeDivHeight();  //左侧树结构
    contentDivHeight();  //房屋状态列表
}
function changeDivHeight() {
    var c_height = $.CurrentNavtab.find(".divHouseList").parents(".navtabPage").outerHeight(true);
    var h_height = $.CurrentNavtab.find(".divHouseList").prev(".bjui-pageHeader").outerHeight(true);
    $.CurrentNavtab.find(".divHouseList").height(c_height - h_height - 10);
}

function contentDivHeight() {
    /*var c_height = $(".tabsPageContent").outerHeight(true);
    $(".divHouseBox").height(c_height -160);*/
}

//zdTree
function zdTree(e) {
    BJUI.ajax('doajax', {
        url: path + e.parentUrl,
        loadingmask: false,
        callback: function (json) {
            if (json.code == "00000") {
                if(json.data.length==0){
                    $('#' + e.id).append('<span style="display: inline-block;padding: 5px">没有数据</span>');
                }
                for (var i = 0; i < json.data.length; i++) {
                    var info = JSON.stringify(json.data[i]);
                    zdOption = e;
                    var value = json.data[i];
                    var ulID = "";
                    if (e.parentID) {
                        var ulID = json.data[i][e.parentID];
                    }
                    if (i != json.data.length - 1) {
                        var html = '<li style="margin-bottom: 2px" data=\'' + info + '\' id="' + ulID + '"><div style="height: 24px"><span class="button level0 switch roots_close zdSwitchNode" style="vertical-align: top"></span>'
                    } else {
                        var html = '<li style="margin-bottom: 2px" data=\'' + info + '\' id="' + ulID + '"><div style="height: 24px"><span class="button level0 switch bottom_close zdSwitchNode" style="vertical-align: top"></span>'
                    }

                    if (e.column) {
                        var str = "";
                        for (var k = 0; k < e.column.length; k++) {
                            var cup = e.column[k](value);
                            str += cup;
                        }
                    } else {
                        var str = "";
                    }
                    ;

                    if (e.checkbox) {
                        var checkbox = '<span class="button chk radio_false_full" ></span>';
                    } else {
                        var checkbox = '';
                    }
                    var zdLi = html +
                        checkbox +
                        '<span class="zdTreeNodeName"  style="overflow: hidden" title="' + value[e.parentName] + '">' + value[e.parentName] + '</span>' +
                        str +
                        '</div></li>'

                    $('#' + e.id).append(zdLi);
                }
                if (e.parentDescStyle) {
                    $('#' + e.id).find('.zdTreeNodeName').css(e.parentDescStyle);
                }
            } else {
                successBack(json)
            }
        }
    });

    $('#' + e.id).on('click', '.zdSwitchNode', function () {
        if ($(this).attr("class").indexOf("roots_close") > 0 || $(this).attr("class").indexOf("bottom_close") > 0) {
            $(this).removeClass('roots_close bottom_close').addClass('roots_open bottom_open');

            var data = JSON.parse($(this).parent().parent('li').attr('data'));
            // zdOption = JSON.parse($(this).parent('li').attr('zdOption'));
            var param = {};
            param[e.childParam] = data[e.childParam];
            var that = $(this);

            BJUI.ajax('doajax', {
                url: path + e.childUrl,
                data: param,
                loadingmask: false,
                callback: function (json) {
                    if (json.code == "00000") {
                        for (var i = 0; i < json.data.length; i++) {
                            var info = JSON.stringify(json.data[i]);
                            var depth = json.data[i].depth;
                            if (i != json.data.length - 1) {
                                var html = '<span class="button level0 switch roots_close zdSwitchNode"></span>'
                            } else {
                                var html = '<span class="button level0 switch bottom_close zdSwitchNode"></span>'
                            }
                            if (depth == 5) {
                                var html = "";
                            }
                            if (e.depth) {
                                var html = "";
                            }

                            var ulID = "";
                            if (e.childID) {
                                var ulID = json.data[i][e.childID];
                            }

                            if (e.checkbox) {
                                var checkbox = '<span class="button chk radio_false_full" ></span>';
                            } else {
                                var checkbox = '';
                            }
                            var childUl = '<ul class="level0 line" style="margin-top: 2px" >' +
                                '<li class="level1" id="' + ulID + '" style="margin-bottom: 2px" data=\'' + info + '\'>' +
                                '<div style="height: 24px"><span class="button level1 switch bottom_docu" ></span>' +
                                html +
                                checkbox +
                                '<a class="level1" style="cursor:default;display: inline-block;width: 33%;overflow: hidden;text-overflow:ellipsis; position: relative;top: -4px;padding-right: 50px" ><span class="button ico_docu" style="width:0px;height:0px;">' +
                                '</span><span class="textOverFlow" title="' + json.data[i][e.childName] + '">' + json.data[i][e.childName] + '</span></a>';
                            if (zdOption.childColumn) {
                                var str = "";
                                for (var k = 0; k < zdOption.childColumn.length; k++) {
                                    var cup = zdOption.childColumn[k](json.data[i]);
                                    str += cup;
                                }
                            } else {
                                var str = "";
                            }

                            that.parent().parent('li').append(childUl + str + '</div></li></ul>');

                        }
                    } else {
                        successBack(json)
                    }
                }
            });
        } else {
            $(this).removeClass('roots_open bottom_open').addClass('roots_close');
            // $(this).parent().parent('li').children('ul').find('radio_true_full').click();
            $(this).parent().parent('li').children('ul').remove();
        }
        ;
    })

    //点选checkbox函数
    $('#' + e.id).on('click', '.radio_false_full', function () {
        $('.radio_true_full').removeClass('radio_true_full').addClass('radio_false_full')
        $(this).removeClass('radio_false_full').addClass('radio_true_full');
        var dataStr = $(this).parent().parent().attr('data');
        var data = JSON.parse(dataStr);
        if (e.checkCallBack) {
            e.checkCallBack(data);
        }
    });

    //取消点选
    $('#' + e.id).on('click', '.radio_true_full', function () {
        $(this).removeClass('radio_true_full').addClass('radio_false_full');
        if (e.checkCallBack) {
            e.checkCallBack("");
        }
    });
};


//多层联动下拉
var selectOption, elemTop, elemLeft, CurrentElem;
function multiLayerSelect(e) {
    selectOption = e;
    if (e.currentScope) {
        if (e.currentScope == "navtab") {
            CurrentElem = $.CurrentNavtab;
        } else {
            CurrentElem = $.CurrentDialog;
        }
    } else {
        CurrentElem = $.CurrentDialog ? $.CurrentDialog : $.CurrentNavtab;
    }
    CurrentElem.find('#' + e.id).click(function () {
        elemTop = $(this).position().top;
        elemLeft = $(this).position().left;
        var that = $(this);
        BJUI.ajax('doajax', {
            url: e.parentUrl,
            loadingmask: false,
            callback: function (json) {
                if (json.code == "00000") {
                    var data = json.data;
                    $('#ul_' + e.id + ' li').remove();
                    var html = '<li id="zdSelectDefaultOption" class="zdulli zdliSelected" onclick=zdliMOver(this)  onmouseover="radioOver(this)" onmouseout="radioOut(this)"value="" data=""' +
                        'style="width:' + e.optionWidth + ';" depth="1" class="zdulli">' +
                        // '<input type="radio" name="zdSelectRadio" class="zdSelectRadio" >' +
                        '请选择</li>';
                    var Hierarchy = data[0] ? data[0][selectOption.depth] : 0;
                    for (var i = 0; i < data.length; i++) {
                        var info = JSON.stringify(data[i]);
                        html += '<li onclick=zdliMOver(this)  ondblclick="dbClickLi(this)" onmouseover="radioOver(this)" onmouseout="radioOut(this)" style="width:' + e.optionWidth + ';" depth="' + data[i][e.depth] + '" class="zdulli" id="' + data[i][e.parentId] + '"value="' + data[i][e.parentId] + '" data=\'' + info + '\'>'
                            + data[i][e.parentContent]
                            // + '<input type="radio" name="zdSelectRadio" class="zdSelectRadio" onclick="radioClickZd(this)">'
                            + '<div  name="zdSelectRadio" class="zdSelectRadio graySelect"  onclick="radioClickZd(this)"></div>'
                            + '</li>';
                    }
                    ;
                    var newUL =
                        '<ul id="' + 'ul_' + e.id + '" class="zdul" style="" depth="' + Hierarchy + '">'
                        + html
                        + '</ul>';
                    that.parent().append(newUL);
                    $('#ul_' + e.id).css({
                        'position': 'absolute',
                        'top': elemTop + 23,
                        'left': elemLeft,
                        'z-index': 9999,
                    });

                } else {
                    successBack(json);
                }
            }
        })
    });
}

var clickEvent;
function zdliMOver(event) {
    clickEvent = event;
    window.event ? window.event.cancelBubble = true : e.stopPropagation();
    clearTimeout(clickTime);
    clickTime = setTimeout(function () {
        zdLiClickCallBack(clickEvent)
    }, 180)
}

function zdLiClickCallBack(event) {
    var id = event.id;
    if (id == 'zdSelectDefaultOption') {
        $('#zdSelectDefaultOption').addClass('zdliSelected').siblings('li').removeClass('zdliSelected');
        $('.zdSelectArea').find('ul[depth]').each(function () {
            var dp = $(this).attr('depth');
            if (dp > 1) {
                $(this).remove();
            }
        });
        return;
    }

    var that = $.CurrentDialog ? $.CurrentDialog.find('#' + id) : $.CurrentNavtab.find('#' + id);
    that.addClass('zdliSelected').siblings('li').removeClass('zdliSelected');
    var elemWidth = that.outerWidth(true);
    var parentLiData = JSON.parse(that.attr('data'));
    var parentLiVal = that.attr('value');
    var postData = {};
    var pram = parentLiData[selectOption.childpostValue];
    postData[selectOption.childKey] = pram;
    var currentDepth = that.attr('depth');
    $('.zdSelectArea').find('ul[depth]').each(function () {
        var dp = $(this).attr('depth');
        if (dp > currentDepth) {
            $(this).remove();
        }
    });
    if (true) {
        BJUI.ajax('doajax', {
            url: selectOption.childUrl,
            loadingmask: false,
            data: postData,
            asyn: false,
            callback: function (json) {
                if (json.code == "00000") {
                    var data = json.data;
                    if (data.length == 0) {
                        return
                    }
                    var html = "";
                    var Hierarchy = data[0] ? data[0][selectOption.depth] : 0;
                    for (var i = 0; i < data.length; i++) {
                        var info = JSON.stringify(data[i]);
                        html += '<li class="zdulli" style="width:' + selectOption.optionWidth + ';" ondblclick="dbClickLi(this)" onclick=zdliMOver(this) onmouseover="radioOver(this)" onmouseout="radioOut(this)" depth="' + data[i][selectOption.depth] +
                            '" id="' + data[i][selectOption.childId] + '" value="' + data[i][selectOption.childId] +
                            '" data=\'' + info + '\'>' + data[i][selectOption.childContent] +
                            '<div  name="zdSelectRadio" class="zdSelectRadio graySelect"  onclick="radioClickZd(this)"></div>' +
                            // '<input type="radio" name="zdSelectRadio" class="zdSelectRadio" onclick="radioClickZd(this)">' +
                            '</li>';
                    }
                    ;
                    var fatherID = that.attr('id');
                    var newUL = '<ul id="' + 'ulSon_' + parentLiVal + '" fatherID="' + fatherID + '" class="zdul" style="" depth="' + Hierarchy + '">'
                        + html
                        + '</ul>';
                    $('#' + selectOption.id).parent().append(newUL);
                    var param = Hierarchy - 1;
                    $('#ulSon_' + parentLiVal).css({
                        'position': 'absolute',
                        'top': elemTop + 22,
                        'left': elemLeft + elemWidth * param,
                        'z-index': 9999,
                    });
                } else {
                    successBack(json);
                }
            }
        })
    }
    return false
}


function radioOver(e) {
    var id = e.id;
    CurrentElem.find('li#' + id).css({
        'font-weight': 'bold'
    }).find('.zdSelectRadio').removeClass('graySelect').addClass('blueSelect');

}
function radioOut(e) {
    var id = e.id;
    CurrentElem.find('li#' + id).css({
        'font-weight': 'normal'
    }).find('.zdSelectRadio').removeClass('blueSelect').addClass('graySelect');
}

function radioClickZd(e) {
    var id = e.parentNode.id;
    var value = $('li#' + id).attr('data');
    var data = JSON.parse(value);
    selectOption.selectCallBack(data);
    CurrentElem.find('.zdSelectArea .zdul').remove();
}
var clickTime = null;
function dbClickLi(e) {
    clearTimeout(clickTime);
    var liJqObj = $(e);
    var value = liJqObj.attr('data');
    var data = JSON.parse(value);
    selectOption.selectCallBack(data);
    CurrentElem.find('.zdSelectArea .zdul').remove();
}